# 1. Запросите два числа
# 2. Запросите операцию (+, -, *, /)
# 3. Используя if/elif/else, выполните нужную операцию
# 4. Выведите результат и его тип
number1 = int(input("введите 1 число: "))
number2 = int(input("введите 2 число: "))
x = (input)("operation")
if x == "+":
    print(number1+number2)
if x == "-":
    print(number1-number2)
if x == "*":
    print(number1*number2)
if x == "/":
    print(number1/number2)
